# На вход подается строка, состоящая из одного числа. Напишите программу, которая удваивает его
print(int(input())*2)